package section2;

/**
 * description    : 기본형 VS 참조형 2 - 변수대입
 * packageName    : section2
 * fileName       : class2
 * author         : JSY
 * date           : 2024-01-07
 * ===========================================================
 * DATE              AUTHOR             NOTE
 * -----------------------------------------------------------
 * 2024-01-07        JSY       최초 생성
 */
public class class2 {
    /**
     * 기본형 :
     * 참조형
     */

    /*
    기본형은 변수에 값을 대입하더라도, 실제 사용하는 값이 변수에 바로 들어있기 때문에 해당 값만 복사해서 대입한다고
    생각하면 쉽게 이해 가능.

    그러나 참조형의 경우 실제 사용하는 객체가 아니라 객체의 위치를 가르키는 참조값만 복사된다.
    쉽게 이야기해서 실제 건물이 복사가 되는게 아니라 건물의 위치인 주소만 복사가 되는 것.
    따라서 같은 건물으 찾아갈 수 있는 방법이 하나 늘어날 뿐이다.
    */

}
